import java.time.LocalDateTime;

// Настроить проект, вывести в консоль “Hello world!”.
// Вывести в консоль системные дату и время


public class Hello {
    public static void main(String[] args) {
        System.out.println("Hello world");
        System.out.println(LocalDateTime.now());
    }
}
// Data
// Calendar
// LocalDateTime